export enum Color {
    red = 0xff6347,
    blue = 0x6495ed,
    yellow = 0xf0e68c,
    green = 0x32cd32,
    ylgreen = 0x98fb98,
    gray = 0x999999,
    ltblue = 0xc71585,
    magenta = 0x87cefa,
    white = 0xeeeeee,
    brown = 0xc0ae9a,
}

type Rect = {
    y: number;
    x1: number;
    z1: number;
    x2: number;
    z2: number;
    color?: Color;
};

const Rects_中学棟1階: Rect[] = [
    {
        //雑華ホール
        y: 0,
        x1: -130,
        z1: 100,
        x2: 75,
        z2: -65,
        color: Color.red,
    },
    {
        //1A
        y: 0,
        x1: 100,
        z1: -20,
        x2: 150,
        z2: 50,
        color: Color.red,
    },
    {
        //1B
        y: 0,
        x1: 100,
        z1: -90,
        x2: 150,
        z2: -20,
        color: Color.red,
    },
    {
        //1C
        y: 0,
        x1: 100,
        z1: -180,
        x2: 150,
        z2: -110,
        color: Color.red,
    },
    {
        //1D
        y: 0,
        x1: 100,
        z1: -180,
        x2: 150,
        z2: -250,
        color: Color.red,
    },
    {
        //1E
        y: 0,
        x1: -5,
        z1: -320,
        x2: 75,
        z2: -250,
        color: Color.red,
    },
    {
        y: 0,
        x1: 100,
        z1: -110,
        x2: 150,
        z2: -90,
    },
    {
        y: 0,
        x1: 75,
        z1: -400,
        x2: 100,
        z2: 100,
    },
    {
        y: 0,
        x1: 100,
        z1: 75,
        x2: 125,
        z2: 280,
    },
    {
        y: 0,
        x1: 125,
        z1: 125,
        x2: 175,
        z2: 280,
        color: Color.gray,
    },
    {
        y: 0,
        x1: 100,
        z1: 280,
        x2: 175,
        z2: 340,
        color: Color.gray,
    },
];
const Rects_中学棟2階: Rect[] = [
    {
        //2A
        y: 150,
        x1: 100,
        z1: -20,
        x2: 150,
        z2: 50,
        color: Color.red,
    },
    {
        //2B
        y: 150,
        x1: 100,
        z1: -90,
        x2: 150,
        z2: -20,
        color: Color.red,
    },
    {
        //2C
        y: 150,
        x1: 100,
        z1: -180,
        x2: 150,
        z2: -110,
        color: Color.red,
    },
    {
        //2D
        y: 150,
        x1: 100,
        z1: -180,
        x2: 150,
        z2: -250,
        color: Color.red,
    },
    {
        //2E
        y: 150,
        x1: -5,
        z1: -320,
        x2: 75,
        z2: -250,
        color: Color.red,
    },
    {
        //和室
        y: 150,
        x1: 0,
        z1: 250,
        x2: 50,
        z2: 340,
        color: Color.red,
    },
    {
        y: 150,
        x1: 75,
        z1: -320,
        x2: 100,
        z2: 75,
    },
    {
        y: 150,
        x1: 100,
        z1: -90,
        x2: 150,
        z2: -110,
    },
    {
        y: 150,
        x1: 0,
        z1: 75,
        x2: 125,
        z2: 180,
    },
    {
        y: 150,
        x1: 50,
        z1: 180,
        x2: 125,
        z2: 280,
    },
    {
        y: 150,
        x1: 0,
        z1: 180,
        x2: 50,
        z2: 250,
        color: Color.gray,
    },
    {
        y: 150,
        x1: 125,
        z1: 125,
        x2: 175,
        z2: 280,
        color: Color.gray,
    },
    {
        y: 150,
        x1: 100,
        z1: 280,
        x2: 175,
        z2: 340,
        color: Color.gray,
    },
    {
        y: 150,
        x1: 50,
        z1: 280,
        x2: 100,
        z2: 340,
        color: Color.yellow,
    },
];
const Rects_中学棟3階: Rect[] = [
    {
        //3A
        y: 300,
        x1: 100,
        z1: -20,
        x2: 150,
        z2: 50,
        color: Color.red,
    },
    {
        //3B
        y: 300,
        x1: 100,
        z1: -90,
        x2: 150,
        z2: -20,
        color: Color.red,
    },
    {
        //3C
        y: 300,
        x1: 100,
        z1: -180,
        x2: 150,
        z2: -110,
        color: Color.red,
    },
    {
        //3D
        y: 300,
        x1: 100,
        z1: -180,
        x2: 150,
        z2: -250,
        color: Color.red,
    },
    {
        //3E
        y: 300,
        x1: -5,
        z1: -320,
        x2: 75,
        z2: -250,
        color: Color.red,
    },
    {
        y: 300,
        x1: 75,
        z1: -320,
        x2: 100,
        z2: 75,
    },
    {
        y: 300,
        x1: 100,
        z1: -90,
        x2: 150,
        z2: -110,
    },
    {
        y: 300,
        x1: 0,
        z1: 75,
        x2: 125,
        z2: 100,
    },
    {
        y: 300,
        x1: 100,
        z1: 100,
        x2: 125,
        z2: 225,
    },
    {
        y: 300,
        x1: 0,
        z1: 225,
        x2: 175,
        z2: 340,
        color: Color.gray,
    },
    {
        y: 300,
        x1: 125,
        z1: 175,
        x2: 175,
        z2: 225,
        color: Color.gray,
    },
    {
        y: 300,
        x1: 125,
        z1: 125,
        x2: 175,
        z2: 175,
        color: Color.yellow,
    },
];
const Rects_高校棟1階: Rect[] = [
    {
        y: 0,
        x1: -175,
        z1: -375,
        x2: -250,
        z2: -450,
        color: Color.blue,
    },
    {
        y: 0,
        x1: -60,
        z1: -350,
        x2: -290,
        z2: -375,
    },
];
const Rects_高校棟2階: Rect[] = [
    {
        //音楽室
        y: 150,
        x1: -375,
        z1: -50,
        x2: -300,
        z2: 50,
        color: Color.blue,
    },
    {
        //6A
        y: 150,
        x1: -225,
        z1: -50,
        x2: -175,
        z2: -120,
        color: Color.blue,
    },
    {
        //6B
        y: 150,
        x1: -225,
        z1: -120,
        x2: -175,
        z2: -190,
        color: Color.blue,
    },
    {
        //6C
        y: 150,
        x1: -225,
        z1: -210,
        x2: -175,
        z2: -280,
        color: Color.blue,
    },
    {
        //6D
        y: 150,
        x1: -225,
        z1: -280,
        x2: -175,
        z2: -350,
        color: Color.blue,
    },
    {
        //6E
        y: 150,
        x1: -250,
        z1: -375,
        x2: -175,
        z2: -450,
        color: Color.blue,
    },
    {
        y: 150,
        x1: -275,
        z1: 75,
        x2: -150,
        z2: 190,
    },
    {
        y: 150,
        x1: -250,
        z1: -375,
        x2: -225,
        z2: 75,
    },
    {
        y: 150,
        x1: -250,
        z1: -350,
        x2: -290,
        z2: -375,
    },
    {
        y: 150,
        x1: -300,
        z1: 0,
        x2: -250,
        z2: 25,
    },
    {
        y: 150,
        x1: -225,
        z1: -190,
        x2: -175,
        z2: -210,
    },
    {
        y: 150,
        x1: -225,
        z1: -30,
        x2: -150,
        z2: 75,
        color: Color.gray,
    },
];
const Rects_高校棟3階: Rect[] = [
    {
        //生物室
        y: 300,
        x1: -225,
        z1: 100,
        x2: -150,
        z2: 175,
        color: Color.blue,
    },
    {
        //5A
        y: 300,
        x1: -225,
        z1: -50,
        x2: -175,
        z2: -120,
        color: Color.blue,
    },
    {
        //5B
        y: 300,
        x1: -225,
        z1: -120,
        x2: -175,
        z2: -190,
        color: Color.blue,
    },
    {
        //5C
        y: 300,
        x1: -225,
        z1: -210,
        x2: -175,
        z2: -280,
        color: Color.blue,
    },
    {
        //5D
        y: 300,
        x1: -225,
        z1: -280,
        x2: -175,
        z2: -350,
        color: Color.blue,
    },
    {
        y: 300,
        x1: -250,
        z1: -375,
        x2: -175,
        z2: -450,
        color: Color.blue,
    },
    {
        y: 300,
        x1: -225,
        z1: -25,
        x2: -150,
        z2: 50,
        color: Color.blue,
    },
    {
        y: 300,
        x1: -375,
        z1: -25,
        x2: -300,
        z2: 50,
        color: Color.blue,
    },
    {
        y: 300,
        x1: -300,
        z1: -25,
        x2: -250,
        z2: 0,
    },
    {
        y: 300,
        x1: -250,
        z1: -375,
        x2: -225,
        z2: 75,
    },
    {
        y: 300,
        x1: -225,
        z1: -190,
        x2: -175,
        z2: -210,
    },
    {
        y: 300,
        x1: -150,
        z1: 75,
        x2: -325,
        z2: 100,
    },
    {
        y: 300,
        x1: -250,
        z1: 100,
        x2: -225,
        z2: 225,
    },
    {
        y: 300,
        x1: -225,
        z1: -375,
        x2: -300,
        z2: -350,
    },
    {
        y: 300,
        x1: -325,
        z1: 100,
        x2: -250,
        z2: 175,
        color: Color.gray,
    },
];
const Rects_高校棟4階: Rect[] = [
    {
        //4B
        y: 450,
        x1: -225,
        z1: -50,
        x2: -175,
        z2: -120,
        color: Color.blue,
    },
    {
        //4C
        y: 450,
        x1: -225,
        z1: -120,
        x2: -175,
        z2: -190,
        color: Color.blue,
    },
    {
        //4D
        y: 450,
        x1: -225,
        z1: -210,
        x2: -175,
        z2: -280,
        color: Color.blue,
    },
    {
        //4E
        y: 450,
        x1: -225,
        z1: -280,
        x2: -175,
        z2: -350,
        color: Color.blue,
    },
    {
        //視聴覚室
        y: 450,
        x1: -225,
        z1: -25,
        x2: -150,
        z2: 75,
        color: Color.blue,
    },
    {
        //4A
        y: 450,
        x1: -375,
        z1: -25,
        x2: -300,
        z2: 50,
        color: Color.blue,
    },
    {
        //情報教室
        y: 450,
        x1: -325,
        z1: 100,
        x2: -250,
        z2: 175,
        color: Color.blue,
    },
    {
        //美術室
        y: 450,
        x1: -250,
        z1: 100,
        x2: -150,
        z2: 175,
        color: Color.blue,
    },
    {
        y: 450,
        x1: -300,
        z1: -25,
        x2: -250,
        z2: 0,
    },
    {
        y: 450,
        x1: -250,
        z1: -350,
        x2: -225,
        z2: 75,
    },
    {
        y: 450,
        x1: -225,
        z1: -190,
        x2: -175,
        z2: -210,
    },
    {
        y: 450,
        x1: -275,
        z1: 75,
        x2: -225,
        z2: 100,
    },
];
const Rects_転心殿: Rect[] = [
    {
        y: 150,
        x1: -150,
        z1: 100,
        x2: 0,
        z2: 150,
    },
    {
        y: 300,
        x1: -150,
        z1: 75,
        x2: 0,
        z2: 100,
    },
    {
        y: 150,
        x1: -130,
        z1: 75,
        x2: -150,
        z2: 100,
    },
];
const Rects_図書館棟1階: Rect[] = [
    {
        y: 200,
        x1: -250,
        z1: 300,
        x2: -175,
        z2: 350,
        color: Color.blue,
    },
    {
        y: 200,
        x1: -250,
        z1: 350,
        x2: -175,
        z2: 400,
        color: Color.blue,
    },
    {
        y: 200,
        x1: -250,
        z1: 400,
        x2: -175,
        z2: 475,
        color: Color.green,
    },
    {
        y: 150,
        x1: -250,
        z1: 190,
        x2: -225,
        z2: 225,
    },
    {
        y: 200,
        x1: -250,
        z1: 250,
        x2: -225,
        z2: 300,
    },
    {
        y: 200,
        x1: -300,
        z1: 275,
        x2: -250,
        z2: 300,
    },
    {
        y: 200,
        x1: -275,
        z1: 300,
        x2: -250,
        z2: 475,
    },
    {
        y: 200,
        x1: -325,
        z1: 330,
        x2: -275,
        z2: 350,
    },
    {
        y: 200,
        x1: -325,
        z1: 300,
        x2: -275,
        z2: 330,
        color: Color.gray,
    },
    {
        y: 200,
        x1: -325,
        z1: 350,
        x2: -275,
        z2: 420,
        color: Color.gray,
    },
    {
        y: 200,
        x1: -325,
        z1: 420,
        x2: -275,
        z2: 475,
        color: Color.gray,
    },
    {
        y: 200,
        x1: -300,
        z1: 250,
        x2: -250,
        z2: 275,
        color: Color.yellow,
    },
];
const Rects_図書館棟2階: Rect[] = [
    {
        y: 350,
        x1: -325,
        z1: 300,
        x2: -175,
        z2: 475,
        color: Color.blue,
    },
    {
        y: 350,
        x1: -300,
        z1: 250,
        x2: -250,
        z2: 275,
        color: Color.yellow,
    },
    {
        y: 350,
        x1: -300,
        z1: 275,
        x2: -275,
        z2: 300,
        color: Color.yellow,
    },
    {
        y: 350,
        x1: -250,
        z1: 250,
        x2: -225,
        z2: 300,
    },
    {
        y: 350,
        x1: -275,
        z1: 275,
        x2: -250,
        z2: 300,
    },
];
const Rects_圓融館_体育館: Rect[] = [
    {
        y: 0,
        x1: 100,
        z1: -400,
        x2: -60,
        z2: -425,
    },
    {
        y: 0,
        x1: -60,
        z1: -375,
        x2: -100,
        z2: -425,
    },
    {
        y: 0,
        x1: 175,
        z1: -390,
        x2: 100,
        z2: -425,
    },
    {
        y: 0,
        x1: 450,
        z1: -325,
        x2: 175,
        z2: -450,
        color: Color.ltblue,
    },
    {
        y: -100,
        x1: 25,
        z1: -525,
        x2: -200,
        z2: -900,
        color: Color.magenta,
    },
];
const Rects_中庭: Rect[] = [
    {
        y: 200,
        x1: -130,
        z1: -75,
        x2: 20,
        z2: 50,
        color: Color.ylgreen,
    },
    {
        y: 200,
        x1: -130,
        z1: -35,
        x2: -160,
        z2: -75,
        color: Color.ylgreen,
    },
    {
        y: 100,
        x1: 20,
        z1: -110,
        x2: -10,
        z2: -190,
        color: Color.ylgreen,
    },
    {
        y: 100,
        x1: 20,
        z1: -225,
        x2: -115,
        z2: -190,
        color: Color.ylgreen,
    },
    {
        y: 150,
        x1: -130,
        z1: -190,
        x2: -175,
        z2: -210,
        color: Color.ylgreen,
    },
    {
        y: 90,
        x1: 75,
        z1: -150,
        x2: 25,
        z2: -225,
        color: Color.ylgreen,
    },
    {
        y: 50,
        x1: -50,
        z1: -250,
        x2: -110,
        z2: -350,
        color: Color.ylgreen,
    },
    {
        y: 50,
        x1: -110,
        z1: -300,
        x2: -120,
        z2: -350,
        color: Color.ylgreen,
    },
    {
        y: 0,
        x1: 5,
        z1: -65,
        x2: -10,
        z2: -75,
    },
];

/** 長方形 y: y座標(高さ) x1,x2: 端のx座標 z1,z2: 端のz座標 color: 表面の色(省略した場合は白) */
export const Rects: Rect[] = [
    ...Rects_中学棟1階,
    ...Rects_中学棟2階,
    ...Rects_中学棟3階,
    ...Rects_転心殿,
    ...Rects_高校棟1階,
    ...Rects_高校棟2階,
    ...Rects_高校棟3階,
    ...Rects_高校棟4階,
    ...Rects_図書館棟1階,
    ...Rects_図書館棟2階,
    ...Rects_圓融館_体育館,
    ...Rects_中庭,
];

type Polygon = {
    points: [number, number, number][];
    color?: Color;
};

const Polygons_小講堂: Polygon[] = [
    {
        points: [
            [0, 300, 100],
            [0, 300, 225],
            [100, 300, 225],
            [100, 300, 140],
            [60, 300, 100],
        ],
        color: Color.red,
    },
    {
        points: [
            [60, 300, 100],
            [100, 300, 140],
            [100, 300, 100],
        ],
    },
];
const Polygons_中庭: Polygon[] = [
    {
        points: [
            [20, 200, -75],
            [20, 100, -110],
            [5, 100, -110],
            [5, 200, -75],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-115, 100, -210],
            [-130, 150, -210],
            [-130, 150, -190],
            [-115, 100, -190],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-10, 100, -110],
            [-10, 100, -190],
            [-95, 100, -190],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-130, 150, -190],
            [-145, 150, -190],
            [-145, 200, -75],
            [-130, 200, -75],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-130, 200, -35],
            [-145, 200, -35],
            [-145, 150, 75],
            [-130, 150, 75],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [20, 150, 75],
            [20, 200, 50],
            [5, 200, 50],
            [5, 150, 75],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [25, 90, -150],
            [25, 90, -170],
            [20, 100, -170],
            [20, 100, -150],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [20, 100, -225],
            [20, 90, -250],
            [-20, 90, -250],
            [-20, 100, -225],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [0, 50, -330],
            [0, 50, -360],
            [-50, 50, -350],
            [-50, 50, -300],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [75, 0, -330],
            [75, 0, -380],
            [0, 50, -360],
            [0, 50, -330],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-20, 100, -225],
            [-20, 50, -300],
            [-35, 50, -300],
            [-35, 100, -225],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-35, 50 + 50 * (2 / 3), -250],
            [-35, 50, -300],
            [-50, 50, -300],
            [-50, 50 + 50 * (2 / 3), -250],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-20, 50, -300],
            [-20, 50, -318],
            [-50, 50, -300],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [-72, 100, -225],
            [-72, 50, -250],
            [-88, 50, -250],
            [-88, 100, -225],
        ],
        color: Color.ylgreen,
    },
    {
        points: [
            [5, 100, -110],
            [-10, 100, -110],
            [-10, 0, -75],
            [5, 0, -75],
        ],
    },
    {
        points: [
            [-10, 0, -65],
            [-10, 0, -75],
            [-95, 0, -155],
            [-130, 0, -155],
            [-130, 0, -65],
        ],
    },
];
const Polygons_体育館: Polygon[] = [
    {
        points: [
            [-60, 0, -425],
            [-60, -100, -525],
            [-100, -100, -525],
            [-100, 0, -425],
        ],
    },
];

//階段エフェクトを置くことにしたので、削除
const Polygons_図書館棟: Polygon[] = [
    {
        points: [
            [-225, 150, 225],
            [-250, 150, 225],
            [-250, 200, 250],
            [-225, 200, 250],
        ],
    },
    {
        points: [
            [-225, 300, 225],
            [-250, 300, 225],
            [-250, 350, 250],
            [-225, 350, 250],
        ],
    },
];

/** 多角形
 *  points: 頂点 ([x座標, y座標, z座標]のタプル) を反時計回りに並べた配列
 *  color: 表面の色(省略した場合は白)
 * */
export const Polygons: Polygon[] = [
    ...Polygons_小講堂,
    ...Polygons_中庭,
    ...Polygons_体育館,
    /*, ...Polygons_図書館棟,*/
];

//begin-endを対角線とする直方体
type Box = {
    begin: [number, number, number];
    end: [number, number, number];
    color?: Color;
};

//中学棟職員室側
const Boxes_中学棟: Box[] = [
    {
        //昇降口
        begin: [125, 0, 75],
        end: [175, 300, 125],
        color: Color.gray,
    },
    {
        //CD間1
        begin: [25, 0, -125],
        end: [75, 50, -75],
        color: Color.gray,
    },
    {
        //CD間2
        begin: [25, 50, -125],
        end: [75, 100, -75],
        color: Color.yellow,
    },
    {
        //CD間3
        begin: [25, 100, -125],
        end: [75, 200, -75],
        color: Color.gray,
    },
    {
        //CD間4
        begin: [25, 200, -125],
        end: [75, 250, -75],
        color: Color.yellow,
    },
    {
        //CD間5
        begin: [25, 250, -125],
        end: [75, 300, -75],
        color: Color.gray,
    },
];

const Boxes_高校棟: Box[] = [
    {
        //昇降口
        begin: [-300, 150, 25],
        end: [-250, 450, 75],
        color: Color.gray,
    },
    {
        //CD間1
        begin: [-300, 150, -225],
        end: [-250, 200, -175],
        color: Color.gray,
    },
    {
        //CD間2
        begin: [-300, 200, -225],
        end: [-250, 250, -175],
        color: Color.yellow,
    },
    {
        //CD間3
        begin: [-300, 250, -225],
        end: [-250, 350, -175],
        color: Color.gray,
    },
    {
        //CD間4
        begin: [-300, 350, -225],
        end: [-250, 400, -175],
        color: Color.yellow,
    },
    {
        //CD間5
        begin: [-300, 400, -225],
        end: [-250, 450, -175],
        color: Color.gray,
    },
    {
        //体育館
        begin: [-250, 0, -425],
        end: [-290, 300, -375],
        color: Color.gray,
    },
];

const Boxes_図書館棟: Box[] = [
    {
        begin: [-200, 150, 250],
        end: [-250, 350, 225],
        color: Color.gray,
    },
];

export const Boxes: Box[] = [...Boxes_中学棟, ...Boxes_高校棟, ...Boxes_図書館棟];

export const ExhibitionPositions: [string, number, number, number][] = [
    //中学棟1階
    ["書道部", 125, 0, 15], //1A
    ["東菁会", 125, 0, -55], //1B
    ["独楽同好会", 125, 0, -127.5], //1C-1
    ["学年展示", 125, 0, -162.5], //1C-2
    ["学年展示", 125, 0, -215], //1D
    ["学年展示", 35, 0, -285], //1E

    //中学棟2階
    ["囲碁将棋部", 125, 150, 15], //2A
    ["オセロ同好会", 125, 150, -37.5], //2B-1
    ["チェス研究会", 125, 150, -72.5], //2B-2
    ["学年展示", 125, 150, -145], //2C
    ["学年展示", 125, 150, -215], //2D
    ["学年展示", 35, 150, -285], //2E
    //["お茶席", 25, 150, 295], //和室
    //↑svg形式が他とは違くて、他のアイコンの30倍くらい大きい。svgのrxを取ってくればこちらで変更することもできるが...

    //中学棟3階
    ["謎解き研究会", 125, 300, -2.5], //3A-1
    ["暗号同好会", 125, 300, 32.5], //3A-1
    ["ロケット研究部", 125, 300, -37.5], //3B-1
    ["VOCALOID&作曲同好会", 125, 300, -72.5], //3B-2
    ["休憩室", 125, 300, -145], //3C
    //↑circleやrectではなくpathで囲い込みがされているので、白く塗られていない。
    ["学年展示", 125, 300, -215], //3D
    ["学年展示", 35, 300, -285], //3E

    //高校棟1階
    ["鉄道研究部", -212.5, 20, -412.5],

    //高校棟2階
    ["PRパート", -200, 150, -85], //6A
    ["園芸部", -200, 150, -155], //6B
    ["歴史部菁史会", -200, 150, -227.5], //6C-1
    ["民族音楽同好会", -200, 150, -262.5], //6C-2
    ["電子工作部", -200, 150, -315], //6D
    ["折り紙研究部", -212.5, 150, -412.5], //6E

    //高校棟3階
    ["科学部", -187.5, 300, 137.5], //生物室
    ["自動車研究会", -200, 300, -67.5], //5A-1
    ["ラーメン研究会", -200, 300, -102.5], //5A-2
    ["英語部", -200, 300, -137.5], //5B-1
    ["写真部", -200, 300, -172.5], //5B-2
    ["数学研究部", -200, 300, -245], //5C
    ["新聞部", -200, 300, -297.5], //5D-1
    ["文藝同好会", -200, 300, -332.5], //5D-2
    ["クイズ研究部", -200, 300, -412.5], //5E

    //高校棟4階
    ["美術部", -200, 450, 117.5], //美術室-1
    ["紅茶同好会", -200, 450, 167.5], //美術室-1
    ["情報研究部", -287.5, 450, 137.5], //情報教室
    ["MGA同好会", -200, 450, -85], //4B
    ["ポケモン同好会", -200, 450, -137.5], //4C-1
    ["東方研究会", -200, 450, -172.5], //4C-2
    ["アニメ研究会", -200, 450, -227.5], //4D-1
    ["ドラえもん研究会", -200, 450, -297.5], //4D-2
    ["マジック同好会", -200, 450, -315], //4E
];
